run/cht-channel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (.05 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (.05 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
    	type			fixedValue;
    	value			uniform (0 0 0);
    }
    
    bottom
    {
    	type			fixedValue;
    	value			uniform (0 0 0);
    }
    
    rod
    {
    	type			fixedValue;
    	value			uniform (0 0 0);
    }
    
    defaultFaces
    {
        type empty;
    }
    
}

// ************************************************************************* //
